# Data Programming in Python | BAIS:6040
# Pandas Basics - Exercise Solutions

## Exercises for selecting elements from a series (5 questions)

In [1]:
import numpy as np
import pandas as pd
data = np.arange(10)
index = ["a", "b", "c", "d", "e", "f", "g", "h", "i", "j"]

series = pd.Series(data=data, index=index)
series

a    0
b    1
c    2
d    3
e    4
f    5
g    6
h    7
i    8
j    9
dtype: int64

1\. Get the first element in <i>series</i>.

In [2]:
# Your answer here
series[0]

0

2\. Get the last 3 elements in <i>series</i>.

In [3]:
# Your answer here
series[-3:]

h    7
i    8
j    9
dtype: int64

3\. Get the element in <i>series</i> that the index label 'c' refers to.

In [4]:
# Your answer here
series["c"]

2

4\. Get the elements in <i>series</i> that the index labels 'a', 'c', and 'e' refer to.

In [5]:
# Your answer here
series[["a", "c", "e"]]

a    0
c    2
e    4
dtype: int64

5\. Print all elements in <i>series</i> with a tab between elements.

In [6]:
# Your answer here
for num in series:
    print(num, end="\t")

0	1	2	3	4	5	6	7	8	9

## Exercises for selecting elements from a dataframe (15 questions)

Let's continue to use the Titanic dataset but with another samples this time.

In [7]:
from seaborn import load_dataset
df = load_dataset("titanic")
df = df[["survived", "pclass", "sex", "age", "fare"]].sample(n=20, replace=False, random_state=2)
df

     survived  pclass     sex   age      fare
707         1       1    male  42.0   26.2875
37          0       3    male  21.0    8.0500
615         1       2  female  24.0   65.0000
169         0       3    male  28.0   56.4958
68          1       3  female  17.0    7.9250
606         0       3    male  30.0    7.8958
630         1       1    male  80.0   30.0000
785         0       3    male  25.0    7.2500
660         1       1    male  50.0  133.6500
728         0       2    male  25.0   26.0000
20          0       2    male  35.0   26.0000
486         1       1  female  35.0   90.0000
15          1       2  female  55.0   16.0000
692         1       3    male   NaN   56.4958
643         1       3    male   NaN   56.4958
192         1       3  female  19.0    7.8542
65          1       3    male   NaN   15.2458
597         0       3    male  49.0    0.0000
702         0       3  female  18.0   14.4542
280         0       3    male  65.0    7.7500

1\. Get the columns of <i>df</i>.

In [8]:
# Your answer here
df.columns

Index(['survived', 'pclass', 'sex', 'age', 'fare'], dtype='object')

2\. Get the index of <i>df</i>.

In [9]:
# Your answer here
df.index

Int64Index([707,  37, 615, 169,  68, 606, 630, 785, 660, 728,  20, 486,  15,
            692, 643, 192,  65, 597, 702, 280],
           dtype='int64')

3\. Get the shape of <i>df</i>.

In [10]:
# Your answer here
df.shape

(20, 5)

4\. Get the number of rows, or records, in <i>df</i>.

In [11]:
# Your answer here
len(df)

20

5\. Select all rows under the column <i>survived</i>.

In [12]:
# Your answer here
df.survived  # or df['survived']

707    1
37     0
615    1
169    0
68     1
606    0
630    1
785    0
660    1
728    0
20     0
486    1
15     1
692    1
643    1
192    1
65     1
597    0
702    0
280    0
Name: survived, dtype: int64

6\. Select the first 3 rows.

In [13]:
# Your answer here
df[:3]               # Or df.head(3)

     survived  pclass     sex   age     fare
707         1       1    male  42.0  26.2875
37          0       3    male  21.0   8.0500
615         1       2  female  24.0  65.0000

7\. Select the last 3 rows.

In [14]:
# Your answer here
df[-3:]               # Or df.tail(3)

     survived  pclass     sex   age     fare
597         0       3    male  49.0   0.0000
702         0       3  female  18.0  14.4542
280         0       3    male  65.0   7.7500

8\. Select the element with row index number 615 under the column <i>fare</i>.

In [15]:
# Your answer here
df["fare"][615]

65.0

9\. Select the element in the third row and the fifth column.

In [16]:
# Your answer here
df.iloc[2, 4]

65.0

10\. Select all rows under the last column, not specifying the column label.

In [17]:
# Your answer here
df.iloc[:, -1]

707     26.2875
37       8.0500
615     65.0000
169     56.4958
68       7.9250
606      7.8958
630     30.0000
785      7.2500
660    133.6500
728     26.0000
20      26.0000
486     90.0000
15      16.0000
692     56.4958
643     56.4958
192      7.8542
65      15.2458
597      0.0000
702     14.4542
280      7.7500
Name: fare, dtype: float64

11\. Select all rows under the last 2 columns, not specifying the column labels.

In [18]:
# Your answer here
df.iloc[:, -2:]

      age      fare
707  42.0   26.2875
37   21.0    8.0500
615  24.0   65.0000
169  28.0   56.4958
68   17.0    7.9250
606  30.0    7.8958
630  80.0   30.0000
785  25.0    7.2500
660  50.0  133.6500
728  25.0   26.0000
20   35.0   26.0000
486  35.0   90.0000
15   55.0   16.0000
692   NaN   56.4958
643   NaN   56.4958
192  19.0    7.8542
65    NaN   15.2458
597  49.0    0.0000
702  18.0   14.4542
280  65.0    7.7500

12\. Select the first 5 rows under the last 2 columns, not specifying the column labels.

In [19]:
# Your answer here
df.iloc[:5, -2:]

      age     fare
707  42.0  26.2875
37   21.0   8.0500
615  24.0  65.0000
169  28.0  56.4958
68   17.0   7.9250

13\. Select all rows with their column <i>sex</i> being male.

In [20]:
# Your answer here
df[df.sex == "male"]

     survived  pclass   sex   age      fare
707         1       1  male  42.0   26.2875
37          0       3  male  21.0    8.0500
169         0       3  male  28.0   56.4958
606         0       3  male  30.0    7.8958
630         1       1  male  80.0   30.0000
785         0       3  male  25.0    7.2500
660         1       1  male  50.0  133.6500
728         0       2  male  25.0   26.0000
20          0       2  male  35.0   26.0000
692         1       3  male   NaN   56.4958
643         1       3  male   NaN   56.4958
65          1       3  male   NaN   15.2458
597         0       3  male  49.0    0.0000
280         0       3  male  65.0    7.7500

14\. Select all rows with the column <i>fare</i> being between 50 (inclusive) and 100 (exclusive).

In [21]:
# Your answer here
df[(df.fare >= 50) & (df.fare < 100)]

     survived  pclass     sex   age     fare
615         1       2  female  24.0  65.0000
169         0       3    male  28.0  56.4958
486         1       1  female  35.0  90.0000
692         1       3    male   NaN  56.4958
643         1       3    male   NaN  56.4958

15\. Print all values under the column <i>fare</i> with a tab between the values.

In [22]:
# Your answer here
for num in df.fare:
    print(num, end="\t")

26.2875	8.05	65.0	56.4958	7.925	7.8958	30.0	7.25	133.65	26.0	26.0	90.0	16.0	56.4958	56.4958	7.8542	15.2458	0.0	14.4542	7.75

## Exercises for handling null values (6 questions)

Suppose you have <i>df1</i>, <i>df2</i>, <i>df3</i>, <i>df4</i>, and <i>df5</i>, each of which is a copy of <i>df</i>.

In [23]:
df = load_dataset("titanic")
df = df[["survived", "pclass", "sex", "age", "fare"]].sample(n=10, replace=False, random_state=4)
df.iloc[1, 0] = None
df.iloc[7, 1] = None
df.iloc[3, 4] = None
df.iloc[[5, 9], :] = None

df

     survived  pclass     sex   age     fare
646       0.0     3.0    male  19.0   7.8958
876       NaN     3.0    male  20.0   9.8458
359       1.0     3.0  female   NaN   7.8792
194       1.0     1.0  female  44.0      NaN
819       0.0     3.0    male  10.0  27.9000
55        NaN     NaN    None   NaN      NaN
720       1.0     2.0  female   6.0  33.0000
612       1.0     NaN  female   NaN  15.5000
155       0.0     1.0    male  51.0  61.3792
714       NaN     NaN    None   NaN      NaN

In [24]:
df1, df2, df3, df4, df5 = df.copy(), df.copy(), df.copy(), df.copy(), df.copy()

1\. Select all rows in <i>df</i> with any null values.

In [25]:
# Your answer here
df[df.isnull().any(axis=1)]

     survived  pclass     sex   age     fare
876       NaN     3.0    male  20.0   9.8458
359       1.0     3.0  female   NaN   7.8792
194       1.0     1.0  female  44.0      NaN
55        NaN     NaN    None   NaN      NaN
612       1.0     NaN  female   NaN  15.5000
714       NaN     NaN    None   NaN      NaN

2\. Drop the rows in <i>df1</i> that have any null values. Make sure to assign the resulting dataframe back to <i>df1</i> to actually change <i>df1</i>.

In [26]:
# Your answer here
df1 = df1.dropna()
df1

     survived  pclass     sex   age     fare
646       0.0     3.0    male  19.0   7.8958
819       0.0     3.0    male  10.0  27.9000
720       1.0     2.0  female   6.0  33.0000
155       0.0     1.0    male  51.0  61.3792

3\. Drop the rows in <i>df2</i> in which all values are null. Make sure to assign the resulting dataframe back to <i>df2</i> to actually change <i>df1</i>.

In [27]:
# Your answer here
df2 = df2.dropna(how="all")
df2

     survived  pclass     sex   age     fare
646       0.0     3.0    male  19.0   7.8958
876       NaN     3.0    male  20.0   9.8458
359       1.0     3.0  female   NaN   7.8792
194       1.0     1.0  female  44.0      NaN
819       0.0     3.0    male  10.0  27.9000
720       1.0     2.0  female   6.0  33.0000
612       1.0     NaN  female   NaN  15.5000
155       0.0     1.0    male  51.0  61.3792

4\. Fill the missing values under the column <i>sex</i> in <i>df3</i> with 'unknown'.

In [28]:
# Your answer here
df3.sex = df3.sex.fillna(value="unknown")
df3

     survived  pclass      sex   age     fare
646       0.0     3.0     male  19.0   7.8958
876       NaN     3.0     male  20.0   9.8458
359       1.0     3.0   female   NaN   7.8792
194       1.0     1.0   female  44.0      NaN
819       0.0     3.0     male  10.0  27.9000
55        NaN     NaN  unknown   NaN      NaN
720       1.0     2.0   female   6.0  33.0000
612       1.0     NaN   female   NaN  15.5000
155       0.0     1.0     male  51.0  61.3792
714       NaN     NaN  unknown   NaN      NaN

5\. Fill the missing values under the columns <i>pclass</i>, <i>age</i>, and <i>fare</i> in <i>df4</i> with the minimum value of their column.

In [29]:
# Your answer here
df4 = df4.fillna(value={"pclass": df4.pclass.min(), "age": df4.age.min(), "fare": df4.fare.min()})
df4

     survived  pclass     sex   age     fare
646       0.0     3.0    male  19.0   7.8958
876       NaN     3.0    male  20.0   9.8458
359       1.0     3.0  female   6.0   7.8792
194       1.0     1.0  female  44.0   7.8792
819       0.0     3.0    male  10.0  27.9000
55        NaN     1.0    None   6.0   7.8792
720       1.0     2.0  female   6.0  33.0000
612       1.0     1.0  female   6.0  15.5000
155       0.0     1.0    male  51.0  61.3792
714       NaN     1.0    None   6.0   7.8792

6\. Fill all missing values in <i>df5</i> with the last non-null oberservation backward.

In [30]:
# Your answer here
df5 = df5.fillna(method="bfill")
df5

     survived  pclass     sex   age     fare
646       0.0     3.0    male  19.0   7.8958
876       1.0     3.0    male  20.0   9.8458
359       1.0     3.0  female  44.0   7.8792
194       1.0     1.0  female  44.0  27.9000
819       0.0     3.0    male  10.0  27.9000
55        1.0     2.0  female   6.0  33.0000
720       1.0     2.0  female   6.0  33.0000
612       1.0     1.0  female  51.0  15.5000
155       0.0     1.0    male  51.0  61.3792
714       NaN     NaN    None   NaN      NaN

## Exercises for aggregation and grouping (8 questions)

Let's continue to use the entire Titanic datafame <i>df</i>.

1\. What was the highest fare?

In [31]:
# Your answer here
df.fare.max()

61.3792

2\. What was the lowest fare?

In [32]:
# Your answer here
df.fare.min()

7.8792

3\. What was the mean age of the female passengers? (Select the female passengers first.)

In [33]:
# Your answer here
df[df.sex == "female"].age.mean()

25.0

4\. Select the rows, or passengers, who were under the age of ten and died? (Put two conditions for filtering.)

In [34]:
# Your answer here
df[(df.age <= 10) & (df.survived == 0)]

     survived  pclass   sex   age  fare
819       0.0     3.0  male  10.0  27.9

5\. What were the mean ages for those who survived and who died, respectively? In other words, group the dataframe by <i>survived</i> and get the mean age of each group.

In [35]:
# Your answer here
df.groupby("survived").age.mean()

survived
0.0    26.666667
1.0    25.000000
Name: age, dtype: float64

6\. Group the dataframe by <i>survived</i> and then by <i>pclass</i> and get the mean fare of each group.

In [36]:
# Your answer here
df.groupby(["survived", "pclass"]).fare.mean()

survived  pclass
0.0       1.0       61.3792
          3.0       17.8979
1.0       1.0           NaN
          2.0       33.0000
          3.0        7.8792
Name: fare, dtype: float64

7\. Get a copy of <i>df</i> in which the entire dataframe is sorted by <i>age</i> and then by <i>pclass</i> in descending order, respectively.

In [37]:
# Your answer here
df.sort_values(by=["age", "pclass"], ascending=[False,True])

     survived  pclass     sex   age     fare
155       0.0     1.0    male  51.0  61.3792
194       1.0     1.0  female  44.0      NaN
876       NaN     3.0    male  20.0   9.8458
646       0.0     3.0    male  19.0   7.8958
819       0.0     3.0    male  10.0  27.9000
720       1.0     2.0  female   6.0  33.0000
359       1.0     3.0  female   NaN   7.8792
55        NaN     NaN    None   NaN      NaN
612       1.0     NaN  female   NaN  15.5000
714       NaN     NaN    None   NaN      NaN

8\. Create a random sample of 50 rows with no duplicates from <i>df</i>.

In [38]:
# Your answer here
df.sample(n=50, replace=False)

ValueError: Cannot take a larger sample than population when 'replace=False'